[{"slug":"64363-remote-head-of-people-operations-status","id":"64363","epoch":"1516177669","date":"2018-01-17T00:27:49-08:00","company":"status","position":"Head of People Operations","tags":["ops"],"logo":"","description":"__Status__\r\n\r\nStatus is building powerful decentralized apps on Ethereum that change the way we do things on the web. Our rapidly growing team is made up of self-motivated individuals who prosper in a fast-paced environment and value the ability to work from anywhere.As a product, Status is an open source discovery tool for the Ethereum blockchain that makes it easy for anyone to access apps and services built on the decentralized web. Status also allows users to browse, chat, make payments and more.\r\n\r\n__Opportunity__\r\n\r\nAlthough still in its infancy, blockchain technology is developing rapidly and is poised to have a profound impact on our social, financial and legal systems. By joining us, youâ\u0080\u0099ll help to craft the way people interact with these technologies.\r\n\r\n__Job role__\r\n\r\nWe are looking for a Head of People Operations to support the company scale.Â The role will focus on developing the culture and processes while managing all benefits and HR initiatives in our distributed team.\r\n\r\n__Responsibilities__\r\n\r\n* Development of our internal performance management, including compensation structure\/normalization, promotion process, performance reviews, handling poor performance, etc.\r\n* Improvement and nurture of our Company Culture, scaling and optimizing the company culture while in a distributed team.\r\n* Managing the onboarding, namely scalable onboarding for a distributed team.\r\n* Identifying and proposing company benefits\r\n\r\n__Requirements__\r\n\r\n* Compulsory 3+ years working experience in a remote team\r\n* Hands-on experience scaling remote teams preferably in a high-growth start-up environment\r\n* Experience implementing HR Performance, compensation and promotion processes remotely\r\n* Experience developing innovative approaches to improve organizational culture\r\n* Trustworthy with attention to detail\r\n* Excellent active listening skills, clear communication style, and high intercultural awareness\r\n\r\n__Working at Status__\r\nWe're a remote team of made up of 55 people scattered around the globe. Everyone at Status works from a location of their choosing - and we all meet up twice a year to strategize and strengthen our relationships.\r\n\r\nWe care deeply about open source software, and our organizational structure does away with a strict hierarchy and fixed work hours. We believe in working with a high degree of autonomy while supporting the team's priorities.","url":"https:\/\/remoteok.io\/jobs\/64363"}]